Revit 2026 API

# ElementChangeTypeId(Document, ICollectionElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IDictionary<ElementId, ElementId> ChangeTypeId(
	Document document,
	ICollection<ElementId> elementIds,
	ElementId typeId
)
```
```vb
Public Shared Function ChangeTypeId (
	document As Document,
	elementIds As ICollection(Of ElementId),
	typeId As ElementId
) As IDictionary(Of ElementId, ElementId)
```
```cpp
public:
static IDictionary<ElementId^, ElementId^>^ ChangeTypeId(
	Document^ document,
	ICollection<ElementId^>^ elementIds,
	ElementId^ typeId
)
```
```fsharp
static member ChangeTypeId :
        document : Document *
        elementIds : ICollection<ElementId> *
        typeId : ElementId -> IDictionary<ElementId, ElementId>
```

#### Parameters

document Document

elementIds ICollectionElementId

typeId ElementId

#### Return Value

IDictionaryElementId, ElementId

#### Reference

Element Class

ChangeTypeId Overload

Autodesk.Revit.DB Namespace